{"intents":
	[
		{
			"tag": "greeting",
			"patterns": [ "Hey", "Hello", "What's up?", "How is it going?", "How's it going?", "Hi", "Hi Hi", "Hallo" ],
			"responses": [ "" ]
		},
		{
			"tag": "create_notes",
			"patterns": [ "To create a note, please", "Could you make a note for me", "I need you to jot down a note, please", "Can you create a new note", "Please add a note to my collection", "Assist me in creating a note, please", "I'd like to make a note, if possible", "Could you start a new note for me", "Please generate a note for me", "Can you create a note in my name", "Assist me in writing a note, please", "I need you to record a note for me", "Could you make a quick note, please", "Please help me create a new note", "I'd like to dictate a note to you", "Can you take note of this for me", "Assist me in composing a note, please", "I need you to write down a note for me", "Could you please start a new note", "Please add this to a new note", "Can you create a note with this information", "Assist me in making a note, please", "I'd like to create a note with your help", "Could you please jot down a note for me", "Please generate a new note for me", "Can you create a note and save it", "Assist me in writing a quick note, please", "I need you to record this as a note", "Could you make a note of this, please", "Please help me create a note quickly,", "I'd like to dictate a note to be saved,", "Can you take note of this and save it,", "Assist me in composing a new note, please,", "I need you to write down this information as a note,", "Could you please start a note and save it,", "Please add this to a new note and save it,", "Can you create a note with the following details,", "Assist me in making a note and saving it, please,", "I'd like to create a note and have it saved,", "Could you please jot down this note and save it,", "Please generate a new note and save it,", "Can you create a note and store it,", "Assist me in writing a quick note and saving it, please,", "I need you to record this as a note and save it,", "Could you make a note of this and save it for me,", "Please help me create a note quickly and save it,", "I'd like to dictate a note to be saved in my account,", "Can you take note of this and save it in my notes,", "Assist me in composing a new note and saving it, please,", "I need you to write down this information as a note and save it,", "Could you please start a note and save it in my account,", "Please add this to a new note and save it in my notes." ],
			"responses": [ "" ]
		},
		{
			"tag": "add_to_do_list",
			"patterns": [
				"Add something to my to do list", "Please add this to my to do list", "To add a task to my to-do list, please", "Could you include this in my to-do list", "I need you to add an item to my to-do list, please", "Can you put this on my to-do list", "Please add a task to my to-do list", "Assist me in adding something to my to-do list, please", "I'd like to include this in my to-do list, if possible", "Could you please add a new task to my to-do list", "Please append this to my to-do list", "Can you add this to my to-do list in my name", "Assist me in adding a task to my to-do list, please", "I need you to include a task in my to-do list", "Could you please make a note of this task in my to-do list", "Please help me add a new task to my to-do list", "I'd like to dictate a task to be added to my to-do list", "Can you take note of this and add it to my to-do list", "Assist me in composing a new task for my to-do list, please", "I need you to write down this task and add it to my to-do list", "Could you please start a new task and add it to my to-do list", "Please add this task to a new entry in my to-do list", "Can you add a task with this information to my to-do list", "Assist me in making a task and adding it to my to-do list, please", "I'd like to create a task with your help and add it to my to-do list", "Could you please jot down this task and add it to my to-do list", "Please generate a new task and add it to my to-do list", "Can you add a task and save it to my to-do list", "Assist me in writing a quick task and adding it to my to-do list, please", "I need you to record this as a task and add it to my to-do list", "Could you make a note of this and add it to my to-do list for me", "Please help me create a task quickly and add it to my to-do list", "I'd like to dictate a task to be saved in my to-do list", "Can you take note of this and add it to my to-do list in my account", "Assist me in composing a new task and adding it to my to-do list, please", "I need you to write down this task as an entry in my to-do list", "Could you please start a task and add it to my to-do list in my account", "Please add this task to a new entry in my to-do list and save it", "Can you add a task with the following details to my to-do list", "Assist me in making a task and saving it to my to-do list, please", "I'd like to create a task and have it saved in my to-do list", "Could you please jot down this task and save it in my to-do list", "Please generate a new task and save it in my to-do list", "Can you add a task and store it in my to-do list", "Assist me in writing a quick task and saving it to my to-do list, please", "I need you to record this as a task and save it in my to-do list", "Could you make a note of this and save it as a task in my to-do list"],
			"responses": [""]
		},
		{
			"tag": "show_to_do_list",
			"patterns": [ "Please display my to-do list", "Could you show me my to-do list", "I'd like to see my to-do list, please", "Can you present my to-do list", "Display my current to-do list, please", "I need to view my to-do list", "Please show me what's on my to-do list", "Could you present my list of tasks", "I'd like an overview of my to-do list, please", "Show me the tasks I need to complete", "Please display my outstanding tasks", "Can you show me what I need to do", "I want to see my tasks for today", "Could you present my agenda", "Please show me my list of pending tasks", "Display the tasks I haven't finished yet", "I'd like to view my current task list", "Can you show me my to-do items", "Please present my list of upcoming tasks", "Show me the things I need to get done", "I want to see my task list, please", "Could you display my task manager", "Please show me my scheduled tasks", "Can you present my to-do items", "I'd like to view my list of tasks", "Show me my prioritized tasks", "Please display my action items", "Could you show me my task tracker", "I want to see my list of pending actions", "Please present my current task list", "Show me my tasks for the week", "I'd like to view my to-do list for today", "Can you show me my task dashboard", "Please show me my list of tasks to complete", "Could you display my task scheduler", "I want to see my task checklist, please", "Please present my list of unfinished tasks", "Show me my prioritized to-do items", "I'd like to view my action plan", "Can you show me my task management system", "Please display my list of pending assignments", "Could you show me my task organizer", "I want to see my list of tasks and deadlines", "Please present my current task overview", "Show me my scheduled to-do tasks", "I'd like to view my to-do list for this month", "Can you show me my task log", "Please show me my list of tasks in progress", "Could you display my task tracker for today", "I want to see my list of tasks for this week" ],
			"responses": [ "" ]
		},

		{
			"tag": "weather",
			"patterns":["What's the weather like today?", "What's the forecast for today?", "Can you tell me about the weather today?", "How's the weather today?", "What's the weather forecast?", "Will it rain today?", "Is it going to be sunny today?", "Do I need an umbrella today?", "Should I wear a jacket today?", "What's the temperature today?", "What's the humidity today?", "What's the wind speed today?", "What's the atmospheric condition today?", "What's the weather like right now?", "Can you provide the weather update?", "What's the weather outlook?", "Can you give me the weather report?", "Tell me about the current weather conditions.", "Is it hot outside?", "Is it cold today?", "What's the weather going to be like later?", "Are there any chances of storms today?", "What's the weather situation?", "Can you check the weather for me?", "What's the climate like today?", "Is it foggy outside?", "What's the UV index today?", "What's the visibility today?", "What's the precipitation forecast?", "What's the weather prediction for the day?", "Is it going to be hot today?", "Is it going to be cold today?", "Is it going to be snowing today?", "Is it going to be raining today?", "Is it going to rain today?", "Is it going to snow today?", "What type of clothes should I wear?", "Is it going to be sunny today?", "Is it going to be cloudy today?", "Is it going to be windy today?", "What's the weather like today?", "What's the weather forecast for today?", "Can you tell me about the weather today?", "How's the weather today?", "What's the weather going to be like?", "Will it rain today?", "Is it going to be sunny today?", "Do I need an umbrella today?", "Should I wear a jacket today?", "What's the temperature today?", "What's the humidity today?", "What's the wind speed today?", "What's the atmospheric condition today?", "What's the weather like right now?", "Can you provide the weather update?", "What's the weather outlook?", "Can you give me the weather report?", "Tell me about the current weather conditions.", "Is it hot outside?", "Is it cold today?", "What's the weather going to be like later?", "Are there any chances of storms today?", "What's the weather situation?", "Can you check the weather for me?", "What's the climate like today?", "Is it foggy outside?", "What's the UV index today?", "What's the visibility today?", "What's the precipitation forecast?", "What's the weather prediction for the day?", "Can you tell me the weather for tomorrow?", "What's the weather like in [city]?", "What's the forecast for the weekend?", "Will it be windy today?", "What's the weather like during the day?", "Are there any weather alerts?", "Tell me about the sunset time today.", "What's the weather going to be like in the evening?", "Is it going to be humid today?", "What's the weather like right now in [specific location]?", "Can you give me an hourly weather update?", "Are there any chances of snowfall today?", "What's the forecast for my upcoming trip?", "What's the weather like for the next few days?", "Can you check if there are any weather warnings?", "What's the UV index for today?", "Tell me the weather conditions for the next 24 hours.", "Can you check if it's going to be foggy tonight?"],
			"responces": [ "" ]
		},
		{
			"tag": "search",
			"patterns": [ "Can you Google this for me", "I need to find information about", "Please search for", "Look up", "Find me details on", "Retrieve information about", "Search the web for", "Can you find out about", "Please look into", "Find relevant information about", "Search for answers about", "Can you provide me with details on", "Retrieve data on", "Please look up details about", "Find me resources on", "Please search for information about", "Look up facts about", "Can you find me information regarding", "Search for relevant details about", "Please provide me with search results for", "I'm looking for information about", "Can you bring up details on", "Search for relevant information on", "Find sources about", "Retrieve search results on", "Please look for data on", "Look into this topic for me", "Can you search for articles on", "Find relevant sources about", "Please find details on", "Search the internet for", "I'm curious about", "Can you fetch information about", "Look for facts on", "Please find me resources on", "Provide search results for", "Retrieve relevant information about", "Search for news articles about", "Can you locate details on", "Look up recent information about", "Please search for data on", "Find me images of", "Can you search for videos on", "Retrieve relevant sources about", "Please find news about", "Search for scholarly articles on", "Look up definitions for", "Can you find examples of" ],
			"responses": [ "" ]
		},
		{
			"tag": "quit",
			"patterns": [ "Exit the program", "Close the application", "Quit", "Stop", "End", "Terminate", "Shut down", "Turn off", "Finish", "Cease operation", "Wrap up", "Abort", "Conclude", "Dismiss", "Wrap it up", "Wrap things up", "Wrap up the session", "Finish the task", "Complete", "Say goodbye", "Goodbye", "Bye", "Leave", "Sign off", "Log out", "Stop listening", "Go away", "Enough for now", "I'm done", "No more", "Finish what you're doing", "Cease processing", "Leave me alone", "Call it a day", "Drop it", "Enough", "Close up shop", "Conclude the interaction", "Cease functioning", "Stop responding", "Break off", "Desist", "Discontinue", "Halt", "Pull the plug", "Power down", "Put an end to it", "Cut it out" ],
			"responses": [ "" ]
		},
		{
			"tag": "open_efundi",
			"patterns": ["Can you please open efundi?","Could you open efundi for me?","I need to access efundi. Can you help me open it?","Would you mind opening efundi?","Is it possible for you to open efundi?","I'm requesting to open efundi. Can you assist?","May I ask you to open efundi?","Is there a way you could open efundi for me?","Could you kindly open efundi?","Would you be able to open efundi?","I require access to efundi. Could you open it?","Can you please initiate efundi for me?","Is it okay if you open efundi?","I'm in need of efundi access. Can you open it?","Could you do me a favor and open efundi?","May I request you to open efundi?","I'm unable to open efundi. Can you help?","Would you be so kind as to open efundi?","I'd appreciate it if you could open efundi for me.","Do you mind opening efundi?","Open efundi","Open efundi, please.","Access efundi, now.","Launch efundi, now.","Enable efundi, please.","Start efundi, now.","Initiate efundi, please.","Activate efundi, now.","Begin efundi, please.","Load efundi, now.","Can you please open efundi for me?","Could you assist me in accessing efundi?","I'm having trouble with efundi. Can you help open it?","Would you mind helping me open efundi?","Is it possible for you to open efundi on my behalf?","I kindly request you to open efundi for me.","May I ask for your support in opening efundi?","Is there any chance you could open efundi for me?","Could you kindly lend a hand in opening efundi?","Would you be so kind as to open efundi on my behalf?","I require immediate access to efundi. Can you please open it?","Can you please initiate efundi login on my behalf?","Is it okay if you assist me in opening efundi?","I urgently need to access efundi. Can you help me open it?","Could you do me a favor and open efundi for me, please?","May I request your assistance in opening efundi?","I'm having difficulty opening efundi. Can you provide support?","Would you mind opening efundi for me, please?","I'd greatly appreciate it if you could open efundi for me.","Do you mind helping me open efundi, please?"],
			"responses": [""]
		},
		{
			"tag": "open_application",
			"patterns": ["Can you please open the app?","Could you open the app for me?","I need to access the app. Can you help me open it?","Would you mind opening the app?","Is it possible for you to open the app?","I'm requesting to open the app. Can you assist?","May I ask you to open the app?","Is there a way you could open the app for me?","Could you kindly open the app?","Would you be able to open the app?","I require access to the app. Could you open it?","Can you please initiate the app for me?","Is it okay if you open the app?","I'm in need of app access. Can you open it?","Could you do me a favor and open the app?","May I request you to open the app?","I'm unable to open the app. Can you help?","Would you be so kind as to open the app?","I'd appreciate it if you could open the app for me.","Do you mind opening the app?","Can you please open something?","Could you open something for me?","I need to access something. Can you help me open it?","Would you mind opening something?","Is it possible for you to open something?","I'm requesting to open something. Can you assist?","May I ask you to open something?","Is there a way you could open something for me?","Could you kindly open something?","Would you be able to open something?","I require access to something. Could you open it?","Can you please initiate something for me?","Is it okay if you open something?","I'm in need of access to something. Can you open it?","Could you do me a favor and open something?","May I request you to open something?","I'm unable to open something. Can you help?","Would you be so kind as to open something?","I'd appreciate it if you could open something for me.","Do you mind opening something?","Open please.","Open","Open app, please.","Access app, now.","Launch app, immediately.","Enable app, quickly.","Start app, now."],
			"responses": [""]
		},
		{
			"tag": "open_email",
			"patterns": ["Can you please open my email?","Could you open my email for me?","I need to access my email. Can you help me open it?","Would you mind opening my email?","Is it possible for you to open my email?","I'm requesting to open my email. Can you assist?","May I ask you to open my email?","Is there a way you could open my email for me?","Could you kindly open my email?","Would you be able to open my email?","I require access to my email. Could you open it?","Can you please initiate my email for me?","Is it okay if you open my email?","I'm in need of email access. Can you open it?","Could you do me a favor and open my email?","May I request you to open my email?","I'm unable to open my email. Can you help?","Would you be so kind as to open my email?","I'd appreciate it if you could open my email for me.","Do you mind opening my email?","Open email, please.","Access email, now.","Launch email, immediately.","Enable email, quickly.","Start email, now.","Open my email, please.","Access my email, now.","Launch my email, immediately.","Enable my email, quickly.","Start my email, now.","Open email account, please.","Access email account, now.","Launch email account, immediately.","Enable email account, quickly.","Start email account, now.","Open my email account, please.","Access my email account, now.","Launch my email account, immediately.","Enable my email account, quickly.","Start my email account, now."],
			"responses": [""]
		},
		{
			"tag": "see_timetable",
			"patterns": ["Can you please open my timetable?","Could you open my timetable for me?","I need to access my timetable. Can you help me open it?","Would you mind opening my timetable?","Is it possible for you to open my timetable?","I'm requesting to open my timetable. Can you assist?","May I ask you to open my timetable?","Is there a way you could open my timetable for me?","Could you kindly open my timetable?","Would you be able to open my timetable?","I require access to my timetable. Could you open it?","Can you please initiate my timetable for me?","Is it okay if you open my timetable?","I'm in need of my timetable access. Can you open it?","Could you do me a favor and open my timetable?","May I request you to open my timetable?","I'm unable to open my timetable. Can you help?","Would you be so kind as to open my timetable?","I'd appreciate it if you could open my timetable for me.","Do you mind opening my timetable?","Open my timetable, please.","Access my timetable, now.","Launch my timetable, quickly.","Enable my timetable, now.","Start my timetable, please.","Open timetable, please.","Access timetable, now.","Launch timetable, quickly.","Enable timetable, now.","Start timetable, please.","Please open my timetable.","Can you access my timetable?","Could you launch my timetable?","Help me open my timetable.","Can you please start my timetable?","Open my timetable now.","Access my timetable immediately.","Launch my timetable quickly.","Please help open my timetable.","Start my timetable now, please.","Can you open timetable?","Access timetable for me.","Launch timetable quickly.","Help open timetable, please.","Start timetable immediately.","Open my class timetable.","Access my weekly timetable.","Launch my study timetable.","Help me find timetable."],
			"responses": [""]
		},
		{
			"tag": "show_loadshedding",
			"patterns": ["Can you please show load shedding?","Could you display load shedding for me?","I need to see the load shedding. Can you show it?","Would you mind showing the load shedding?","Is it possible for you to show the load shedding?","I'm requesting to see the load shedding. Can you assist?","May I ask you to show the load shedding?","Is there a way you could show the load shedding for me?","Could you kindly display the load shedding?","Would you be able to show the load shedding?","I require information on the load shedding. Can you show it?","Can you please provide the load shedding details?","Is it okay if you show the load shedding?","I'm in need of load shedding information. Can you show it?","Could you do me a favor and show the load shedding?","May I request you to display the load shedding?","I'm unable to see the load shedding. Can you help?","Would you be so kind as to show the load shedding?","I'd appreciate it if you could show the load shedding for me.","Do you mind showing the load shedding?","Show load shedding.","Display load shedding now.","Present load shedding information.","Reveal load shedding details.","See load shedding immediately.","Provide load shedding updates.","Display load shedding status.","Present load shedding schedule.","Reveal load shedding data.","Show current load shedding.","Can you show load shedding data, please?","Please display current load shedding schedule, now.","Could you reveal load shedding details, please?","Can you present load shedding information, now?","Please show the current load shedding, now.","Could you display the load shedding data, please?","Can you reveal the load shedding schedule, now?","Please present the load shedding details, now.","Could you show the load shedding information, please?","Can you display the current load shedding, now?","Please reveal load shedding data, now.","Could you present the load shedding schedule, please?","Can you show load shedding information, please?","Please display current load shedding data, now.","Could you reveal the load shedding details, now?","Can you present the load shedding schedule, please?","Please show the current load shedding data, now.","Could you display the load shedding information, please?","Can you reveal the load shedding details, please?","Please present the current load shedding schedule, now."],
			"responses": [""]
		}
 ]
}